spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
#include <stdint.h>
#include <cstring>
#include <cmath>

#include "bsp.hpp"
#include "error.hpp"
#include "debug.hpp"
#include "gpio.hpp"
#include "scheduler.hpp"
#include "timer.hpp"
#include "binascii.hpp"
#include "smd_sat_cmd_spi.hpp"
#include "pmu.hpp"

#include "nrf_delay.h"
#include "nrf_gpio.h"

SmdSatCmdSpi::SmdSatCmdSpi()
    : m_nrf_spim(nullptr)
    , m_protocol_mode(SpiProtocolMode::APLUS)
    , m_sequence_number(0)
    , m_protocol_detected(true)
    , m_dfu_mode(false)
{
    memset(&m_dfu_info, 0, sizeof(m_dfu_info));
}

SmdSatCmdSpi::~SmdSatCmdSpi() {
    deinit();
}

void SmdSatCmdSpi::init() {
    if (m_nrf_spim == nullptr) {
        m_nrf_spim = new (std::nothrow) NrfSPIM(SPI_SATELLITE);
        if (m_nrf_spim == nullptr) {
            DEBUG_ERROR("SmdSatCmdSpi::init: SPI allocation failed");
            throw ErrorCode::RESOURCE_NOT_AVAILABLE;
        }
        // CS is managed by NrfSPIM::transfer() — do NOT force it low here
    }
    m_protocol_mode = SpiProtocolMode::APLUS;
    m_protocol_detected = true;
    m_sequence_number = 0;
}

void SmdSatCmdSpi::deinit() {
    if (m_nrf_spim) {
        delete m_nrf_spim;
        m_nrf_spim = nullptr;
        nrf_gpio_cfg_output(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
        nrf_gpio_pin_clear(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
        nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.mosi_pin, NRF_GPIO_PIN_PULLDOWN);
        nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.miso_pin, NRF_GPIO_PIN_PULLDOWN);
        nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.sck_pin, NRF_GPIO_PIN_PULLDOWN);
    }
}

void SmdSatCmdSpi::read_byte(uint8_t *byte_read) {
    nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    uint8_t read_cmd = SMDSAT_CMD_NONE;
    int ret;

    ret = m_nrf_spim->transfer(&read_cmd, byte_read, sizeof(read_cmd));
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::send_command(uint8_t command) {
    uint8_t buffer_read;
    int ret;
	DEBUG_TRACE("%s::Send %u",__func__, command);

    ret = m_nrf_spim->transfer(&command, &buffer_read, sizeof(command));
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::send_command(const uint8_t *tx_data, uint8_t *rx_data, uint16_t size) {
    int ret = m_nrf_spim->transfer(tx_data, rx_data, size);
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
}

// ============================================================================
// Protocol A+ Implementation (Based on Zephyr argos-smd-driver)
// ============================================================================
// Key features:
// - Fixed 64-byte frames with 0xFF padding
// - CRC-8 over MAGIC + SEQ + CMD + LEN + DATA (includes MAGIC!)
// - Pipelined protocol: response to command N arrives in transaction N+2
// - BUSY pattern (0xBB) handling for flash operations
// ============================================================================

uint16_t SmdSatCmdSpi::build_aplus_frame(uint8_t *frame, uint8_t cmd, const uint8_t *data, uint16_t data_len) {
    // Max data that fits in a single 64-byte frame: 64 - 4(header) - 1(CRC) = 59
    constexpr uint16_t single_frame_capacity = SPI_PROTOCOL_APLUS_FRAME_SIZE
        - SPI_PROTOCOL_APLUS_HEADER_LEN - SPI_PROTOCOL_APLUS_CRC_LEN;
    if (data_len > single_frame_capacity) {
        DEBUG_ERROR("SmdSatCmdSpi::%s: Data too long for single frame (%u > %u)", __func__, data_len, single_frame_capacity);
        return 0;
    }

    // Initialize frame with padding
    memset(frame, SPI_PROTOCOL_APLUS_PAD_BYTE, SPI_PROTOCOL_APLUS_FRAME_SIZE);

    uint16_t idx = 0;

    // Build frame: [MAGIC][SEQ][CMD][LEN][DATA][CRC8][PADDING...]
    frame[idx++] = SPI_PROTOCOL_APLUS_MAGIC_REQUEST;
    frame[idx++] = m_sequence_number;
    frame[idx++] = cmd;
    frame[idx++] = static_cast<uint8_t>(data_len);

    // Copy data if any
    if (data != nullptr && data_len > 0) {
        memcpy(&frame[idx], data, data_len);
        idx += data_len;
    }

    // Calculate CRC-8 over MAGIC + SEQ + CMD + LEN + DATA (includes MAGIC!)
    uint8_t crc = spi_crc8_ccitt(frame, idx);
    frame[idx++] = crc;

    DEBUG_TRACE("SmdSatCmdSpi::%s: Frame built - SEQ=%u | CMD=0x%02X | LEN=%u | CRC=0x%02X",
                __func__, m_sequence_number, cmd, data_len, crc);

    // Return fixed frame size for SPI transfer
    return SPI_PROTOCOL_APLUS_FRAME_SIZE;
}

bool SmdSatCmdSpi::parse_aplus_response(const uint8_t *rx_buffer, uint16_t rx_len, SpiAplusResponse *response) {
    if (response == nullptr || rx_buffer == nullptr) {
        return false;
    }

    response->valid = false;
    response->data_len = 0;

    // Scan for response magic byte, skipping IDLE (0xAA) and padding (0xFF)
    // (matches Zephyr parse_response_frame behavior)
    uint16_t offset = 0;
    while (offset < rx_len) {
        if (rx_buffer[offset] == SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
            break;
        }
        if (rx_buffer[offset] == SPI_PROTOCOL_APLUS_BUSY_PATTERN) {
            DEBUG_TRACE("SmdSatCmdSpi::%s: BUSY pattern at offset %u", __func__, offset);
            response->status = SPI_APLUS_STATUS_BUSY;
            return false;
        }
        if (rx_buffer[offset] != SPI_PROTOCOL_APLUS_IDLE_PATTERN &&
            rx_buffer[offset] != SPI_PROTOCOL_APLUS_PAD_BYTE) {
            break;
        }
        offset++;
    }

    if (offset >= rx_len || rx_buffer[offset] != SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
        if (rx_buffer[0] == SPI_PROTOCOL_APLUS_IDLE_PATTERN) {
            DEBUG_TRACE("SmdSatCmdSpi::%s: IDLE pattern - no response ready", __func__);
            response->status = SPI_APLUS_STATUS_NOT_READY;
        } else {
            DEBUG_TRACE("SmdSatCmdSpi::%s: No response magic found (first byte: 0x%02X)", __func__, rx_buffer[0]);
            response->status = SPI_APLUS_STATUS_FRAME_ERROR;
        }
        return false;
    }

    // Minimum frame: MAGIC + SEQ + STATUS + LEN + CRC = 5 bytes
    if (rx_len - offset < SPI_PROTOCOL_APLUS_HEADER_LEN + SPI_PROTOCOL_APLUS_CRC_LEN) {
        DEBUG_WARN("SmdSatCmdSpi::%s: Response too short after offset %u", __func__, offset);
        return false;
    }

    // Parse header at offset
    response->seq = rx_buffer[offset + 1];
    response->status = static_cast<SpiAplusStatus>(rx_buffer[offset + 2]);
    uint8_t data_len = rx_buffer[offset + 3];

    if (data_len > SPI_PROTOCOL_APLUS_MAX_DATA_LEN) {
        DEBUG_WARN("SmdSatCmdSpi::%s: Invalid data length %u", __func__, data_len);
        response->status = SPI_APLUS_STATUS_SIZE_ERROR;
        return false;
    }

    // Bounds check: header + data + CRC must fit in remaining buffer
    uint16_t expected_len = SPI_PROTOCOL_APLUS_HEADER_LEN + data_len + SPI_PROTOCOL_APLUS_CRC_LEN;
    if (rx_len - offset < expected_len) {
        DEBUG_WARN("SmdSatCmdSpi::%s: Response incomplete: got %u | expected %u",
                   __func__, rx_len - offset, expected_len);
        response->status = SPI_APLUS_STATUS_FRAME_ERROR;
        return false;
    }

    // Copy data
    response->data_len = data_len;
    if (data_len > 0) {
        memcpy(response->data, &rx_buffer[offset + 4], data_len);
    }

