spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
		// Check if we're getting consistent idle pattern (0xAA)
		bool all_idle = true;
		for (int j = 0; j < 8; j++) {
			if (rx_buf[j] != SPI_PROTOCOL_APLUS_IDLE_PATTERN) {
				all_idle = false;
				break;
			}
		}

		if (all_idle) {
			sync_count++;
			if (sync_count >= 2) {
				DEBUG_INFO("SmdSatCmdSpi::%s: SPI synchronized after %d transactions", __func__, i + 1);
				return;
			}
		} else {
			sync_count = 0;
		}

		nrf_delay_ms(SMDSAT_SPI_DETECT_TIMEOUT_MS);
	}

	DEBUG_WARN("SmdSatCmdSpi::%s: SPI sync incomplete | proceeding anyway", __func__);
}

void SmdSatCmdSpi::get_status(uint8_t *status) {
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_SPI_STATUS, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read SPI status", __func__);
		*status = SMDSAT_SPICMD_ERROR;
		return;
	}
	*status = rx[0];
	DEBUG_TRACE("SmdSatCmdSpi::%s: status=%u", __func__, *status);
}

void SmdSatCmdSpi::get_kmac_status(uint8_t *status) {
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_MAC_STATUS, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read KMAC status", __func__);
		*status = MAC_ERROR;
		return;
	}
	*status = rx[0];
	DEBUG_TRACE("SmdSatCmdSpi::%s: status=%u", __func__, *status);
}

void SmdSatCmdSpi::set_radio_conf(smd_uint8_array_t *radio_conf) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (radio_conf->size != SMDSAT_CMD_WRITECONF_LEN - 1) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Size mismatch %u != %u",
			__func__, radio_conf->size, SMDSAT_CMD_WRITECONF_LEN - 1);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	if (!send_command_2phase(SMDSAT_CMD_WRITE_RCONF_REQ, SMDSAT_CMD_WRITE_RCONF,
	                         radio_conf->p_data, radio_conf->size)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to set radio conf", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::read_radio_conf(SmdArgosModulation *modulation) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	uint8_t rx[SMDSAT_CMD_READCONF_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_RCONF, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read radio conf", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}

	uint32_t min_frequency = ((uint32_t)rx[3] << 24) | ((uint32_t)rx[2] << 16) | ((uint32_t)rx[1] << 8) | rx[0];
	uint32_t max_frequency = ((uint32_t)rx[7] << 24) | ((uint32_t)rx[6] << 16) | ((uint32_t)rx[5] << 8) | rx[4];
	int8_t rf_level = rx[8];
	*modulation = static_cast<SmdArgosModulation>(rx[9]);

	DEBUG_INFO("SmdSatCmdSpi::%s: Modulation: %u | Min Freq: %u | Max Freq: %u | RF Level %d", __func__,
		*modulation, min_frequency, max_frequency, rf_level);
}

bool SmdSatCmdSpi::save_radio_conf() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (!send_command_auto(SMDSAT_CMD_SAVE_RCONF)) {
		DEBUG_WARN("SmdSatCmdSpi::%s: Radio conf failed to save", __func__);
		return false;
	}
	DEBUG_INFO("SmdSatCmdSpi::%s: Radio conf saved", __func__);
	return true;
}

void SmdSatCmdSpi::read_lpm(uint8_t *lpm_mode) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_LPM, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read LPM", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*lpm_mode = rx[0];
	DEBUG_INFO("SmdSatCmdSpi::SMD LPM mode is: %u", *lpm_mode);
}

void SmdSatCmdSpi::write_lpm(uint8_t *lpm_mode) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (!send_command_2phase(SMDSAT_CMD_WRITE_LPM_REQ, SMDSAT_CMD_WRITE_LPM, lpm_mode, 1)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to write LPM", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::read_version(uint8_t *version) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	uint8_t rx[SPI_PROTOCOL_APLUS_MAX_DATA_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_VERSION, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read version", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	// Copy full version string (not just first byte)
	memcpy(version, rx, rx_len);
	DEBUG_INFO("SmdSatCmdSpi::SMD SPI Version: %.*s", (int)rx_len, (char*)rx);
}

void SmdSatCmdSpi::read_address(smd_uint8_array_t *address) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (address->size != SMDSAT_CMD_READ_ADDR_LEN) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Size mismatch %u != %u",
			__func__, address->size, SMDSAT_CMD_READ_ADDR_LEN);
		return;
	}
	uint16_t rx_len = address->size;
	if (!send_command_auto(SMDSAT_CMD_READ_ADDR, nullptr, 0, address->p_data, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read address", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::set_address(smd_uint8_array_t *address) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (address->size != SMDSAT_CMD_WRITE_ADDR_LEN - 1) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Size mismatch %u != %u",
			__func__, address->size, SMDSAT_CMD_WRITE_ADDR_LEN - 1);
		return;
	}
	if (!send_command_2phase(SMDSAT_CMD_WRITE_ADDR_REQ, SMDSAT_CMD_WRITE_ADDR,
	                         address->p_data, address->size)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to set address", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::read_seckey(smd_uint8_array_t *seckey) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (seckey->size != SMDSAT_CMD_READ_SECKEY_LEN) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Size mismatch %u != %u",
			__func__, seckey->size, SMDSAT_CMD_READ_SECKEY_LEN);
		return;
	}
	uint16_t rx_len = seckey->size;
	if (!send_command_auto(SMDSAT_CMD_READ_SECKEY, nullptr, 0, seckey->p_data, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read seckey", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::set_seckey(smd_uint8_array_t *seckey) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (seckey->size != SMDSAT_CMD_WRITE_SECKEY_LEN - 1) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Size mismatch %u != %u",
			__func__, seckey->size, SMDSAT_CMD_WRITE_SECKEY_LEN);
		return;
	}
	if (!send_command_2phase(SMDSAT_CMD_WRITE_SECKEY_REQ, SMDSAT_CMD_WRITE_SECKEY,
	                         seckey->p_data, seckey->size)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to set seckey", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

