spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
	// Step 3: WRITE_TX (0x16) - Send actual payload data
	{
		SpiAplusResponse response = {};
		send_command_aplus(SMDSAT_CMD_WRITE_TX,
		                   reinterpret_cast<const uint8_t*>(payload.data()), size,
		                   &response);
		if (response.status != SPI_APLUS_STATUS_OK && response.valid) {
			DEBUG_WARN("SmdSatCmdSpi::%s: TX DATA status=%u (non-fatal | data may be queued)",
			           __func__, (unsigned)response.status);
		}
	}

	// Post-TX delay for STM32 async processing
	nrf_delay_ms(SMDSAT_SPI_POST_TX_DELAY_MS);
	return true;
}

// ============================================================================
// DFU (Device Firmware Update) Implementation
// ============================================================================

// CRC-32 MPEG-2 calculation (polynomial 0x04C11DB7)
// Compatible with Zephyr argos-smd-driver
uint32_t SmdSatCmdSpi::calculate_crc32(const uint8_t *data, size_t len) {
	return spi_crc32_mpeg2(data, len);
}

// Matches Zephyr dfu_send_cmd() from argos_smd_dfu_spi.c:
// Protocol A+ two-transaction model:
//   1. Send [0xAA][SEQ][CMD][LEN][DATA][CRC8][pad 0xAA] as single SPI transaction
//   2. Wait command-specific delay
//   3. Send 64-byte idle pattern to read response [0x55][SEQ][STATUS][LEN][DATA][CRC8]
//   4. Re-poll if slave BUSY (0xBB) or transitional (0xAA)
//   5. Parse response, increment sequence number
SmdDfuResponse SmdSatCmdSpi::dfu_send_command(uint8_t cmd, const uint8_t *data, uint16_t data_len,
                                        uint8_t *response_data, uint16_t *response_len) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: cmd=0x%02X | data_len=%u | seq=%u", __func__, cmd, data_len, m_sequence_number);

	// ═══ Step 1: Build Protocol A+ request frame ═══
	// Format: [0xAA][SEQ][CMD][LEN][DATA...][CRC8]
	constexpr uint16_t DFU_LARGE_TX_SIZE = 280;    // BL_SPI_TRANSACTION_SIZE in bootloader
	constexpr uint16_t DFU_TRANSACTION_SIZE = 64;   // Standard poll transaction size
	constexpr uint8_t DFU_MAX_PAYLOAD = 255;
	constexpr uint8_t DFU_BUSY_RETRY_COUNT = 10;
	constexpr uint8_t DFU_BUSY_RETRY_DELAY_MS = 20;

	uint8_t tx_buf[DFU_LARGE_TX_SIZE];
	uint8_t rx_buf[DFU_LARGE_TX_SIZE];
	uint16_t idx = 0;
	int ret;

	if (data_len > DFU_MAX_PAYLOAD) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Payload too large: %u", __func__, data_len);
		return DFU_RSP_SIZE_ERROR;
	}

	// Build frame
	tx_buf[idx++] = SPI_PROTOCOL_APLUS_MAGIC_REQUEST;
	tx_buf[idx++] = m_sequence_number;
	tx_buf[idx++] = cmd;
	tx_buf[idx++] = static_cast<uint8_t>(data_len);

	if (data != nullptr && data_len > 0) {
		memcpy(&tx_buf[idx], data, data_len);
		idx += data_len;
	}

	// CRC calculated over: MAGIC + SEQ + CMD + LEN + DATA
	tx_buf[idx] = spi_crc8_ccitt(tx_buf, idx);
	idx++;

	// Pad to transaction size
	uint16_t tx_size = (idx < DFU_TRANSACTION_SIZE) ? DFU_TRANSACTION_SIZE : idx;
	if (idx < tx_size) {
		memset(&tx_buf[idx], SPI_PROTOCOL_APLUS_IDLE_PATTERN, tx_size - idx);
	}

	DEBUG_TRACE("SmdSatCmdSpi::%s: TX[cmd=0x%02X seq=%u len=%u]: %02X %02X %02X %02X %02X ...",
	            __func__, cmd, m_sequence_number, data_len,
	            tx_buf[0], tx_buf[1], tx_buf[2], tx_buf[3], tx_buf[4]);

	// ═══ Step 2: Transaction 1 — Send command ═══
	// (RX contains idle pattern, ignore it)
	memset(rx_buf, 0, sizeof(rx_buf));
	ret = m_nrf_spim->transfer(tx_buf, rx_buf, tx_size);
	if (ret) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: SPI TX failed: %d", __func__, ret);
		return DFU_RSP_ERROR;
	}

	DEBUG_TRACE("SmdSatCmdSpi::%s: RX1 (idle): %02X %02X %02X %02X",
	            __func__, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3]);

	// ═══ Step 3: Wait for slave to process command ═══
	// For long delays (erase=3000ms), kick watchdog periodically
	uint32_t cmd_delay = get_command_delay(cmd);
	while (cmd_delay > 500) {
		PMU::kick_watchdog();
		nrf_delay_ms(500);
		cmd_delay -= 500;
	}
	if (cmd_delay > 0) {
		nrf_delay_ms(cmd_delay);
	}

	// ═══ Step 4: Transaction 2 — Send idle pattern to read response ═══
	memset(tx_buf, SPI_PROTOCOL_APLUS_IDLE_PATTERN, DFU_TRANSACTION_SIZE);
	memset(rx_buf, 0, sizeof(rx_buf));
	ret = m_nrf_spim->transfer(tx_buf, rx_buf, DFU_TRANSACTION_SIZE);
	if (ret) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: SPI RX failed: %d", __func__, ret);
		return DFU_RSP_ERROR;
	}

	DEBUG_TRACE("SmdSatCmdSpi::%s: RX2: %02X %02X %02X %02X %02X %02X %02X %02X",
	            __func__, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3],
	            rx_buf[4], rx_buf[5], rx_buf[6], rx_buf[7]);

	// ═══ Step 4b: Re-poll until valid response (0x55) received ═══
	auto has_valid_response = [](const uint8_t *buf, uint16_t len) -> bool {
		uint16_t check_len = (len < 8) ? len : 8;
		for (uint16_t i = 0; i < check_len; i++) {
			if (buf[i] == SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
				return true;
			}
		}
		return false;
	};

	auto is_busy_pattern = [](const uint8_t *buf, uint16_t len) -> bool {
		return (len >= 2 && buf[0] == 0xBB && buf[1] == 0xBB);
	};

	uint8_t busy_retries = 0;
	while (!has_valid_response(rx_buf, DFU_TRANSACTION_SIZE) &&
	       busy_retries < DFU_BUSY_RETRY_COUNT) {
		if (is_busy_pattern(rx_buf, DFU_TRANSACTION_SIZE)) {
			DEBUG_TRACE("SmdSatCmdSpi::%s: Slave BUSY (0xBB) | re-polling... (%u/%u)",
			            __func__, busy_retries + 1, DFU_BUSY_RETRY_COUNT);
		}
		// Note: non-busy non-valid response also retries (same action as busy)

		nrf_delay_ms(DFU_BUSY_RETRY_DELAY_MS);

		memset(tx_buf, SPI_PROTOCOL_APLUS_IDLE_PATTERN, DFU_TRANSACTION_SIZE);
		memset(rx_buf, 0, sizeof(rx_buf));
		ret = m_nrf_spim->transfer(tx_buf, rx_buf, DFU_TRANSACTION_SIZE);
		if (ret) {
			DEBUG_ERROR("SmdSatCmdSpi::%s: SPI re-poll failed: %d", __func__, ret);
			return DFU_RSP_ERROR;
		}

		DEBUG_TRACE("SmdSatCmdSpi::%s: RX2 re-poll: %02X %02X %02X %02X %02X %02X %02X %02X",
		            __func__, rx_buf[0], rx_buf[1], rx_buf[2], rx_buf[3],
		            rx_buf[4], rx_buf[5], rx_buf[6], rx_buf[7]);

		busy_retries++;
	}

	if (!has_valid_response(rx_buf, DFU_TRANSACTION_SIZE)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: No valid response after %u retries", __func__, DFU_BUSY_RETRY_COUNT);
		m_sequence_number++;
		return DFU_RSP_ERROR;
	}

	if (busy_retries > 0) {
		DEBUG_TRACE("SmdSatCmdSpi::%s: Slave responded after %u re-polls", __func__, busy_retries);
	}

	// ═══ Step 5: Parse response frame ═══
	SpiAplusResponse response;
	bool parsed = parse_aplus_response(rx_buf, DFU_TRANSACTION_SIZE, &response);

