spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
	// Increment sequence number for next command
	m_sequence_number++;

	if (!parsed) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to parse response", __func__);
		return DFU_RSP_ERROR;
	}

	// Copy response data if requested
	if (response_data != nullptr && response_len != nullptr && response.data_len > 0) {
		uint16_t cpy = (*response_len < response.data_len) ? *response_len : response.data_len;
		memcpy(response_data, response.data, cpy);
		*response_len = cpy;
	} else if (response_len != nullptr) {
		*response_len = response.data_len;
	}

	DEBUG_TRACE("SmdSatCmdSpi::%s: Response status=0x%02X len=%u", __func__, response.status, response.data_len);

	return static_cast<SmdDfuResponse>(response.status);
}

// Matches Zephyr dfu_send_with_retry() — wraps dfu_send_command with automatic
// retry on recoverable errors (BUSY=0x06 and FRAME_CRC_ERROR=0x10).
SmdDfuResponse SmdSatCmdSpi::dfu_send_with_retry(uint8_t cmd, const uint8_t *data, uint16_t data_len,
                                            uint8_t *response_data, uint16_t *response_len) {
	for (int retry = 0; retry < SMDSAT_DFU_MAX_RETRIES; retry++) {
		SmdDfuResponse result = dfu_send_command(cmd, data, data_len, response_data, response_len);

		if (result == DFU_RSP_OK) {
			return DFU_RSP_OK;
		}

		// Check for recoverable errors (matches Zephyr argos_is_recoverable)
		bool recoverable = (result == DFU_RSP_BUSY ||
		                    result == static_cast<SmdDfuResponse>(0x10));  // FRAME_CRC_ERROR
		if (recoverable) {
			DEBUG_WARN("SmdSatCmdSpi::%s: Recoverable error (0x%02X) | retry %d/%d",
			           __func__, static_cast<int>(result), retry + 1, SMDSAT_DFU_MAX_RETRIES);
			nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
			continue;
		}

		// Non-recoverable error — return immediately
		return result;
	}

	DEBUG_ERROR("SmdSatCmdSpi::%s: cmd=0x%02X failed after %d retries", __func__, cmd, SMDSAT_DFU_MAX_RETRIES);
	return DFU_RSP_ERROR;
}

SmdDfuResponse SmdSatCmdSpi::dfu_ping_bl() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	uint8_t response_data[4];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_PING, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && response_len >= 2) {
		DEBUG_INFO("SmdSatCmdSpi::%s: Bootloader v%u.%u", __func__,
		           response_data[0], response_data[1]);
	}

	return result;
}

SmdDfuResponse SmdSatCmdSpi::dfu_get_info(SmdDfuInfo *info) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	if (info == nullptr) {
		return DFU_RSP_ERROR;
	}

	uint8_t response_data[32];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_GET_INFO, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && response_len >= 15) {
		info->version_major = response_data[0];
		info->version_minor = response_data[1];
		info->version_patch = response_data[2];
		// Little-endian parsing (matches Zephyr argos_dfu_get_info)
		info->app_start_addr = response_data[3] | (response_data[4] << 8) |
		                       (response_data[5] << 16) | (response_data[6] << 24);
		info->app_max_size = response_data[7] | (response_data[8] << 8) |
		                     (response_data[9] << 16) | (response_data[10] << 24);
		info->flash_page_size = response_data[11] | (response_data[12] << 8) |
		                        (response_data[13] << 16) | (response_data[14] << 24);

		DEBUG_INFO("SmdSatCmdSpi::%s: Bootloader v%u.%u.%u | app_start=0x%08X | max_size=%u | page_size=%u",
		           __func__, info->version_major, info->version_minor, info->version_patch,
		           info->app_start_addr, info->app_max_size, info->flash_page_size);
	}

	return result;
}

// Matches Zephyr argos_dfu_erase() — 3000ms delay handled inside dfu_send_command
SmdDfuResponse SmdSatCmdSpi::dfu_erase() {
	DEBUG_INFO("SmdSatCmdSpi::%s: Erasing application flash (~2-3 seconds)...", __func__);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_ERASE, nullptr, 0, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		DEBUG_INFO("SmdSatCmdSpi::%s: Flash erased successfully", __func__);
	} else {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Erase failed: 0x%02X", __func__, static_cast<int>(result));
	}

	return result;
}

// Matches Zephyr argos_dfu_write_chunk() — WRITE_REQ + WRITE_DATA with retry
SmdDfuResponse SmdSatCmdSpi::dfu_write_chunk(uint32_t addr, const uint8_t *data, uint16_t len) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: addr=0x%08X | len=%u", __func__, addr, len);

	if (data == nullptr || len == 0 || len > SMDSAT_DFU_CHUNK_SIZE) {
		return DFU_RSP_SIZE_ERROR;
	}

	// STM32 flash requires 8-byte aligned writes
	if ((addr & 0x7) != 0) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Address 0x%08X not 8-byte aligned", __func__, addr);
		return DFU_RSP_ADDR_ERROR;
	}

	// Step 1: WRITE_REQ — Send address and length (little-endian)
	uint8_t req_data[6];
	req_data[0] = addr & 0xFF;
	req_data[1] = (addr >> 8) & 0xFF;
	req_data[2] = (addr >> 16) & 0xFF;
	req_data[3] = (addr >> 24) & 0xFF;
	req_data[4] = len & 0xFF;
	req_data[5] = (len >> 8) & 0xFF;

	SmdDfuResponse result = dfu_send_with_retry(SMDSAT_CMD_DFU_WRITE_REQ, req_data, 6, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: WRITE_REQ failed at 0x%08X: 0x%02X", __func__, addr, static_cast<int>(result));
		return result;
	}

	// Step 2: WRITE_DATA — Send actual data (with retry)
	result = dfu_send_with_retry(SMDSAT_CMD_DFU_WRITE_DATA, data, len, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: WRITE_DATA failed at 0x%08X: 0x%02X", __func__, addr, static_cast<int>(result));
	}

	return result;
}

// Matches Zephyr argos_dfu_read() — READ_REQ + READ_DATA with retry
SmdDfuResponse SmdSatCmdSpi::dfu_read_chunk(uint32_t addr, uint8_t *data, uint16_t len) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: addr=0x%08X | len=%u", __func__, addr, len);

	if (data == nullptr || len == 0) {
		return DFU_RSP_SIZE_ERROR;
	}

	// Step 1: READ_REQ — Send address and length (little-endian)
	uint8_t req_data[6];
	req_data[0] = addr & 0xFF;
	req_data[1] = (addr >> 8) & 0xFF;
	req_data[2] = (addr >> 16) & 0xFF;
	req_data[3] = (addr >> 24) & 0xFF;
	req_data[4] = len & 0xFF;
	req_data[5] = (len >> 8) & 0xFF;

	SmdDfuResponse result = dfu_send_with_retry(SMDSAT_CMD_DFU_READ_REQ, req_data, 6, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: READ_REQ failed: 0x%02X", __func__, static_cast<int>(result));
		return result;
	}

	// Step 2: READ_DATA — Read the data
	uint16_t response_len = len;
	result = dfu_send_with_retry(SMDSAT_CMD_DFU_READ_DATA, nullptr, 0, data, &response_len);

	return result;
}

SmdDfuResponse SmdSatCmdSpi::dfu_verify(uint32_t crc32) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: crc32=0x%08X", __func__, crc32);

