spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
		// Poll READ_SPIMAC_STATE (0x27) for MAC_OK
		bool mac_ready = false;
		for (uint8_t attempt = 0; attempt < 20; attempt++) {
			PMU::kick_watchdog();
			nrf_delay_ms(100);
			uint8_t spi_st = 0, mac_st = 0;
			try { read_spimac_state(&spi_st, &mac_st); } catch (...) { continue; }
			if (mac_st == MAC_OK) {
				DEBUG_INFO("SmdSatCmdSpi::%s: MAC_OK after KMAC load (%ums)", __func__, (attempt+1)*100);
				mac_ready = true;
				break;
			}
			DEBUG_TRACE("SmdSatCmdSpi::%s: waiting MAC_OK (spi=%u mac=%u)", __func__, spi_st, mac_st);
		}
		if (!mac_ready) {
			// Recovery: MAC_ERROR means RCONF is corrupted in STM32 flash.
			// Write credentials (including RCONF) then re-attempt KMAC.
			DEBUG_WARN("SmdSatCmdSpi::%s: MAC_ERROR after KMAC — attempting RCONF recovery via SATTX path", __func__);
			// The SATTX command path (DTEHandler::ARGOSTX_REQ) triggers a full
			// power cycle with state_load_kmac which now has RCONF recovery.
			// For the test, we can't do that — just report the issue.
			return "0/0 MAC_ERR(RCONF_bad_in_STM32,recovery_will_run_at_next_TX)";
		}
	}

	// ================================================================
	// T1: TX VLDA4 baseline — no RCONF change
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T1] TX VLDA4 baseline", __func__);
	run_tx("T1", pkt_default);
	resync_after_tx();

	// ================================================================
	// T2: KMAC reload only (no RCONF change) → TX
	// Isolates: does KMAC reload alone break TX?
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T2] KMAC only → TX", __func__);
	{
		tx_total++;
		bool ok = false;
		try { load_kmac_profil(1); ok = wait_mac_ok(); } catch (...) {}
		if (ok) {
			bool tx_ok = initiate_tx(pkt_default);
			if (!tx_ok) {
				result += "T2:REQ_FAIL ";
			} else {
				uint8_t r = poll_tx_result(6000);
				if (r == MAC_TX_DONE || r == MAC_TX_TIMEOUT) { tx_pass++; result += "T2:OK "; }
				else { result += "T2:MAC" + std::to_string(r) + " "; }
			}
		} else {
			result += "T2:SETUP_FAIL ";
		}
	}
	resync_after_tx();

	// ================================================================
	// T3: SAVE_RCONF only (no set_radio_conf, no KMAC) → TX
	// Isolates: does save_radio_conf alone break TX?
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T3] SAVE only → TX", __func__);
	{
		tx_total++;
		bool ok = false;
		try { ok = save_radio_conf(); } catch (...) {}
		if (ok) {
			nrf_delay_ms(200);
			bool tx_ok = initiate_tx(pkt_default);
			if (!tx_ok) {
				result += "T3:REQ_FAIL ";
			} else {
				uint8_t r = poll_tx_result(6000);
				if (r == MAC_TX_DONE || r == MAC_TX_TIMEOUT) { tx_pass++; result += "T3:OK "; }
				else { result += "T3:MAC" + std::to_string(r) + " "; }
			}
		} else {
			result += "T3:SETUP_FAIL ";
		}
	}
	resync_after_tx();

	// ================================================================
	// T4: SAVE_RCONF + KMAC → TX
	// Isolates: does save + KMAC break TX?
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T4] SAVE+KMAC → TX", __func__);
	{
		tx_total++;
		bool ok = false;
		try {
			ok = save_radio_conf();
			if (ok) { nrf_delay_ms(150); load_kmac_profil(1); ok = wait_mac_ok(); }
		} catch (...) { ok = false; }
		if (ok) {
			bool tx_ok = initiate_tx(pkt_default);
			if (!tx_ok) {
				result += "T4:REQ_FAIL ";
			} else {
				uint8_t r = poll_tx_result(6000);
				if (r == MAC_TX_DONE || r == MAC_TX_TIMEOUT) { tx_pass++; result += "T4:OK "; }
				else { result += "T4:MAC" + std::to_string(r) + " "; }
			}
		} else {
			result += "T4:SETUP_FAIL ";
		}
	}
	resync_after_tx();

	// ================================================================
	// T5: SAVE + KMAC → TX
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T5] SAVE+KMAC → TX", __func__);
	{
		tx_total++;
		bool ok = false;
		try {
			ok = save_radio_conf();
			if (ok) { nrf_delay_ms(150); load_kmac_profil(1); ok = wait_mac_ok(); }
		} catch (...) { ok = false; }
		if (ok) {
			bool tx_ok = initiate_tx(pkt_default);
			if (!tx_ok) {
				result += "T5:REQ_FAIL ";
			} else {
				uint8_t r = poll_tx_result(6000);
				if (r == MAC_TX_DONE || r == MAC_TX_TIMEOUT) { tx_pass++; result += "T5:OK "; }
				else { result += "T5:MAC" + std::to_string(r) + " "; }
			}
		} else {
			result += "T5:SETUP_FAIL ";
		}
	}
	resync_after_tx();

	// ================================================================
	// T6: Back-to-back TX (no config change)
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T6] Back-to-back TX", __func__);
	run_tx("T6", pkt_default);
	resync_after_tx();

	std::string summary = std::to_string(tx_pass) + "/" + std::to_string(tx_total);
	if (tx_pass == tx_total) {
		summary += " ALL_OK";
	}
	summary += " [" + result + "]";

	DEBUG_INFO("SmdSatCmdSpi::%s: === TX FLOW TEST END: %s ===", __func__, summary.c_str());
	return summary;
}

uint8_t SmdSatCmdSpi::poll_tx_result(uint32_t timeout_ms) {
	uint32_t elapsed = 0;
	while (elapsed < timeout_ms) {
		PMU::kick_watchdog();
		uint8_t rx[4] = {0};
		uint16_t rx_len = sizeof(rx);
		if (send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
			uint8_t mac_status = rx[1];
			if (mac_status == MAC_TX_DONE || mac_status == MAC_TX_TIMEOUT ||
			    mac_status == MAC_ERROR || mac_status == MAC_RF_ABORTED ||
			    mac_status == MAC_TX_SIZE_ERROR) {
				DEBUG_INFO("SmdSatCmdSpi::%s: result=%u after %ums", __func__, mac_status, elapsed);
				return mac_status;
			}
		}
		nrf_delay_ms(SMDSAT_TIMING_POLL_MS);
		elapsed += SMDSAT_TIMING_POLL_MS;
	}
	DEBUG_WARN("SmdSatCmdSpi::%s: poll timeout after %ums", __func__, timeout_ms);
	return MAC_ERROR;
}
